engineer-ae3o/stm32-hal-library/components/test/src/i2s.cpp
#include "stm32f411xe.h"
#include "Unity/unity.h"

#include "drivers/spi_internals.h"
#include "drivers/gpio_types.h"
#include "drivers/dma_types.h"
#include "utils/common.h"
#include "utils/clock.h"
#include "drivers/i2s.h"
#include "test/i2s.hpp"
#include "utils/err.h"
#include "utils/log.h"

#include <array>
#include <cstdint>
#include <utility>


namespace test::i2s {

    namespace {

        constexpr const char* TAG = "I2S_Test";

        I2S_TypeDef* const   TEST_INSTANCE = I2S2;
        GPIO_TypeDef* const  MCLK_PORT     = GPIOC;
        constexpr gpio_pin_t MCLK_PIN      = GPIO_PIN_6;

        const i2s_master_config_t DEFAULT_TX_CONFIG = {
            .direction   = I2S_MASTER_TRANSMIT,
            .mode        = I2S_MODE_PHILIPS,
            .frequency   = I2S_FREQ_48kHz,
            .frame       = I2S_DATA_16_BITS_FRAME_16_BITS,
            .audio_clock = AUDIO_PLL_76_8MHz,
            .ckpol       = false,
            .use_mck     = false,
            .ws_pin      = BOARD_I2S2_WS_PB12,
            .sd_pin      = BOARD_I2S2_SD_PB15,
            .mclk_pin    = BOARD_I2S2_MCLK_PC6,
            .sclk_pin    = BOARD_I2S2_SCLK_PB10,
        };

        const i2s_master_config_t DEFAULT_RX_CONFIG = [] {
            i2s_master_config_t cfg = DEFAULT_TX_CONFIG;
            cfg.direction           = I2S_MASTER_RECEIVE;
            return cfg;
        }();

        // Helpers
        volatile bool      s_tx_done = false;
        volatile hal_err_t s_tx_err  = HAL_OK;
        inline void        tx_done_callback(void*, hal_err_t err) {
            s_tx_err  = err;
            s_tx_done = true;
        }

        volatile bool      s_rx_done = false;
        volatile hal_err_t s_rx_err  = HAL_OK;
        inline void        rx_done_callback(void*, hal_err_t err) {
            s_rx_err  = err;
            s_rx_done = true;
        }

        volatile int s_dbm_completions = 0;
        inline void  dbm_callback(void*, hal_err_t err) {
            TEST_ASSERT_EQUAL(HAL_OK, err);
            s_dbm_completions += 1;
        }

        inline bool wait_for(volatile bool& flag) {
            uint32_t timeout = TIMEOUT;
            while (!flag && --timeout);
            return flag;
        }

        inline bool wait_for_count(volatile int& counter, int target) {
            uint32_t timeout = TIMEOUT * 10;
            while ((counter < target) && --timeout);
            return counter >= target;
        }

        inline uint32_t get_gpio_moder(GPIO_TypeDef* port, gpio_pin_t pin) {
            return (port->MODER >> (std::to_underlying(pin) * 2U)) & 0b11U;
        }

        // TESTS
        void invalid_arg_guards() {
            std::array<uint16_t, 4> data{};
            std::array<uint16_t, 4> rx_buf{};
            uint8_t                 buffer_idx = 0;

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2sx_clk_enable(reinterpret_cast<I2S_TypeDef*>(1), true));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_init(nullptr, &DEFAULT_TX_CONFIG));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_init(TEST_INSTANCE, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_deinit(nullptr));

            auto* const bogus_handle = reinterpret_cast<I2S_TypeDef*>(1);
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dma_init(bogus_handle, DMA_PRIORITY_LOW));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dma_deinit(bogus_handle));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_transmit_oneshot(bogus_handle, data.data(), data.size(), nullptr, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_transmit_oneshot(TEST_INSTANCE, nullptr, data.size(), nullptr, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_transmit_oneshot(TEST_INSTANCE, data.data(), 0, nullptr, nullptr));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_receive_oneshot(bogus_handle, rx_buf.data(), rx_buf.size(), nullptr, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_receive_oneshot(TEST_INSTANCE, nullptr, rx_buf.size(), nullptr, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_receive_oneshot(TEST_INSTANCE, rx_buf.data(), 0, nullptr, nullptr));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_init(bogus_handle, data.data(), rx_buf.data(), data.size(), dbm_callback, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_init(TEST_INSTANCE, nullptr, rx_buf.data(), rx_buf.size(), dbm_callback, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_init(TEST_INSTANCE, rx_buf.data(), nullptr, rx_buf.size(), dbm_callback, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_init(TEST_INSTANCE, rx_buf.data(), rx_buf.data(), 0, dbm_callback, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_init(TEST_INSTANCE, rx_buf.data(), rx_buf.data(), rx_buf.size(), nullptr, nullptr));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_deinit(bogus_handle));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_start(bogus_handle));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_stop(bogus_handle));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_get_filled_buffer(bogus_handle, &buffer_idx));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_get_filled_buffer(TEST_INSTANCE, nullptr));
        }

        void init_rejects_invalid_audio_clock_without_touching_registers() {
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.audio_clock         = static_cast<audio_clock_t>(0xFF);

            const uint32_t i2scfgr_before = TEST_INSTANCE->I2SCFGR;
            const uint32_t i2spr_before   = TEST_INSTANCE->I2SPR;

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_init(TEST_INSTANCE, &config));

            TEST_ASSERT_EQUAL_UINT32(i2scfgr_before, TEST_INSTANCE->I2SCFGR);
            TEST_ASSERT_EQUAL_UINT32(i2spr_before, TEST_INSTANCE->I2SPR);
        }

        void init_rejects_prescaler_below_the_supported_range() {
            // Forces i2sdiv < 2: a high nominal sample rate relative to the audio clock, with MCK
            // enabled (multiplier 256), pushes the divisor down below the minimum the hardware supports.
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.audio_clock         = AUDIO_PLL_172MHz;
            config.use_mck             = true;
            config.frequency           = static_cast<i2s_freq_t>(200000); // Not a real or supported audio rate

            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_init(TEST_INSTANCE, &config));
        }

        void init_rejects_prescaler_above_the_supported_range() {
            // Forces i2sdiv > UINT8_MAX: a very low nominal sample rate against a fast audio clock
            // multiplier blows the divisor past what the 8-bit I2SDIV field can hold.
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.audio_clock         = AUDIO_PLL_76_8MHz;
            config.use_mck             = false;
            config.frequency           = static_cast<i2s_freq_t>(500); // Not a real or supported audio rate

            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_init(TEST_INSTANCE, &config));
        }

