engineer-ae3o/stm32-hal-library/components/test/src/i2s.cpp
        void deinit_clears_control_registers() {
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &DEFAULT_TX_CONFIG));

            TEST_ASSERT_TRUE(TEST_INSTANCE->I2SCFGR &
                             (SPI_I2SCFGR_I2SCFG | SPI_I2SCFGR_CKPOL | SPI_I2SCFGR_CHLEN | SPI_I2SCFGR_I2SSTD | SPI_I2SCFGR_DATLEN));
            TEST_ASSERT_TRUE(TEST_INSTANCE->I2SPR & (SPI_I2SPR_I2SDIV | SPI_I2SPR_ODD | SPI_I2SPR_MCKOE));

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));

            TEST_ASSERT_FALSE(TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_I2SE);
            TEST_ASSERT_EQUAL_UINT32(
                0, TEST_INSTANCE->I2SCFGR & (SPI_I2SCFGR_I2SCFG | SPI_I2SCFGR_CKPOL | SPI_I2SCFGR_CHLEN | SPI_I2SCFGR_I2SSTD | SPI_I2SCFGR_DATLEN));
            TEST_ASSERT_EQUAL_UINT32(0, TEST_INSTANCE->I2SPR & (SPI_I2SPR_I2SDIV | SPI_I2SPR_ODD | SPI_I2SPR_MCKOE));

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void init_programs_i2smod_direction_mode_and_polarity() {
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.direction           = I2S_MASTER_TRANSMIT;
            config.mode                = I2S_MODE_LEFT_JUSTIFIED;
            config.ckpol               = true;

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));

            TEST_ASSERT_TRUE(TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_I2SMOD);
            TEST_ASSERT_EQUAL_UINT32(std::to_underlying(I2S_MASTER_TRANSMIT),
                                     (TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_I2SCFG) >> SPI_I2SCFGR_I2SCFG_Pos);
            TEST_ASSERT_EQUAL_UINT32(std::to_underlying(I2S_MODE_LEFT_JUSTIFIED),
                                     (TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_I2SSTD) >> SPI_I2SCFGR_I2SSTD_Pos);
            TEST_ASSERT_TRUE(TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_CKPOL);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));

            // Direction flips and polarity clears
            config.direction = I2S_MASTER_RECEIVE;
            config.ckpol     = false;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));
            TEST_ASSERT_EQUAL_UINT32(std::to_underlying(I2S_MASTER_RECEIVE), (TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_I2SCFG) >> SPI_I2SCFGR_I2SCFG_Pos);
            TEST_ASSERT_FALSE(TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_CKPOL);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void init_programs_the_configured_frame_size() {
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));

            for (const auto frame : {
                     I2S_DATA_16_BITS_FRAME_16_BITS,
                     I2S_DATA_16_BITS_FRAME_32_BITS,
                     I2S_DATA_24_BITS_FRAME_32_BITS,
                     I2S_DATA_32_BITS_FRAME_32_BITS,
                 }) {
                i2s_master_config_t config = DEFAULT_TX_CONFIG;
                config.frame               = frame;

                TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));
                TEST_ASSERT_EQUAL_UINT32(std::to_underlying(frame), TEST_INSTANCE->I2SCFGR & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN));
                TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            }

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void mclk_pin_only_programmed_when_use_mck_is_set() {
            const uint32_t mclk_mode_before = get_gpio_moder(MCLK_PORT, MCLK_PIN);

            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.use_mck             = false;

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));

            // use_mck == false: init must never touch the MCLK pin at all
            TEST_ASSERT_EQUAL_UINT32(mclk_mode_before, get_gpio_moder(MCLK_PORT, MCLK_PIN));
            TEST_ASSERT_FALSE(TEST_INSTANCE->I2SPR & SPI_I2SPR_MCKOE);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));

            config.use_mck = true;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));

            // use_mck == true: MCLK pin goes to alternate function (0b10), and MCKOE gets set
            TEST_ASSERT_EQUAL_UINT32(0b10U, get_gpio_moder(MCLK_PORT, MCLK_PIN));
            TEST_ASSERT_TRUE(TEST_INSTANCE->I2SPR & SPI_I2SPR_MCKOE);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void clk_enable_toggles_the_correct_bus_bit() {
            i2sx_clk_enable(I2S1, false);
            TEST_ASSERT_FALSE(RCC->APB2ENR & RCC_APB2ENR_SPI1EN);
            i2sx_clk_enable(I2S1, true);
            TEST_ASSERT_TRUE(RCC->APB2ENR & RCC_APB2ENR_SPI1EN);
            i2sx_clk_enable(I2S1, false);

            i2sx_clk_enable(I2S2, false);
            TEST_ASSERT_FALSE(RCC->APB1ENR & RCC_APB1ENR_SPI2EN);
            i2sx_clk_enable(I2S2, true);
            TEST_ASSERT_TRUE(RCC->APB1ENR & RCC_APB1ENR_SPI2EN);
            // Leave I2S2 enabled: everything below needs it

            i2sx_clk_enable(I2S3, false);
            TEST_ASSERT_FALSE(RCC->APB1ENR & RCC_APB1ENR_SPI3EN);
            i2sx_clk_enable(I2S3, true);
            TEST_ASSERT_TRUE(RCC->APB1ENR & RCC_APB1ENR_SPI3EN);
            i2sx_clk_enable(I2S3, false);

            i2sx_clk_enable(I2S4, false);
            TEST_ASSERT_FALSE(RCC->APB2ENR & RCC_APB2ENR_SPI4EN);
            i2sx_clk_enable(I2S4, true);
            TEST_ASSERT_TRUE(RCC->APB2ENR & RCC_APB2ENR_SPI4EN);
            i2sx_clk_enable(I2S4, false);

            i2sx_clk_enable(I2S5, false);
            TEST_ASSERT_FALSE(RCC->APB2ENR & RCC_APB2ENR_SPI5EN);
            i2sx_clk_enable(I2S5, true);
            TEST_ASSERT_TRUE(RCC->APB2ENR & RCC_APB2ENR_SPI5EN);
            i2sx_clk_enable(I2S5, false);
        }

        void dma_init_rejects_unsupported_instances() {
            // I2S1 and I2S5 (== SPI1/SPI5) have no DMA streams mapped
            i2sx_clk_enable(I2S1, true);
            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_dma_init(I2S1, DMA_PRIORITY_LOW));
            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_dma_deinit(I2S1));
            i2sx_clk_enable(I2S1, false);

            i2sx_clk_enable(I2S5, true);
            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_dma_init(I2S5, DMA_PRIORITY_LOW));
            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_dma_deinit(I2S5));
            i2sx_clk_enable(I2S5, false);
        }

