engineer-ae3o/stm32-hal-library/components/test/src/i2s.cpp
        void transmit_oneshot_completes_and_invokes_callback() {
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &DEFAULT_TX_CONFIG));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_init(TEST_INSTANCE, DMA_PRIORITY_HIGH));
            audio_pll_clock_config(DEFAULT_TX_CONFIG.audio_clock);

            constexpr auto TX_DATA = std::array{0, 1, 2, 3, 4, 5, 6, 7};

            s_tx_done = false;
            s_tx_err  = HAL_FAIL;

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_transmit_oneshot(TEST_INSTANCE, TX_DATA.data(), TX_DATA.size(), tx_done_callback, nullptr));
            TEST_ASSERT_TRUE_MESSAGE(wait_for(s_tx_done), "I2S DMA oneshot TX never completed");
            TEST_ASSERT_EQUAL(HAL_OK, s_tx_err);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void receive_oneshot_completes_and_invokes_callback() {
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &DEFAULT_RX_CONFIG));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_init(TEST_INSTANCE, DMA_PRIORITY_HIGH));
            audio_pll_clock_config(DEFAULT_RX_CONFIG.audio_clock);

            std::array<uint16_t, 8> rx_buf{};

            s_rx_done = false;
            s_rx_err  = HAL_FAIL;

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_receive_oneshot(TEST_INSTANCE, rx_buf.data(), rx_buf.size(), rx_done_callback, nullptr));
            TEST_ASSERT_TRUE_MESSAGE(wait_for(s_rx_done), "I2S DMA oneshot RX never completed");
            TEST_ASSERT_EQUAL(HAL_OK, s_rx_err);
            // Content is meaningless with nothing driving the SD line. Only completion matters

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void oneshot_rejects_a_call_while_a_transfer_is_still_in_flight() {
            // A deliberately slow bit clock (i2sdiv near mid-range, low nominal sample rate) plus a
            // large buffer keeps the DMA stream genuinely busy for milliseconds. Long enough to
            // reliably observe from software without faking any register state.

            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.audio_clock         = AUDIO_PLL_172MHz;
            config.use_mck             = true;
            config.frequency           = I2S_FREQ_8kHz;

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_init(TEST_INSTANCE, DMA_PRIORITY_LOW));
            audio_pll_clock_config(config.audio_clock);

            std::array<uint16_t, 4096> tx_data{};

            s_tx_done = false;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_transmit_oneshot(TEST_INSTANCE, tx_data.data(), tx_data.size(), tx_done_callback, nullptr));

            // Reentering immediately, before the first transfer has had any real time to finish
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_STATE, i2s_master_transmit_oneshot(TEST_INSTANCE, tx_data.data(), tx_data.size(), nullptr, nullptr));

            TEST_ASSERT_TRUE_MESSAGE(wait_for(s_tx_done), "First I2S DMA oneshot TX never completed");

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void oneshot_doubles_transfer_length_for_24_and_32_bit_frames() {
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.frame               = I2S_DATA_24_BITS_FRAME_32_BITS;

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_init(TEST_INSTANCE, DMA_PRIORITY_LOW));
            audio_pll_clock_config(config.audio_clock);

            std::array<uint32_t, 100> tx_data{};

            // get the DMA stream for I2S2 so we can insect the stream's registers
            dma_stream_map_t dma_map;
            TEST_ASSERT_EQUAL(HAL_OK, spi_master_get_dma_stream_map(&dma_map, 1)); // idx 1 == I2S2

            s_tx_done = false;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_transmit_oneshot(TEST_INSTANCE, tx_data.data(), tx_data.size(), tx_done_callback, nullptr));

            // NDTR is read immediately after starting: for a >16-bit frame the driver must have programmed
            // double the sample count into the DMA stream, since each sample takes two half word DMA beats
            TEST_ASSERT_TRUE(dma_map.tx.stream->NDTR <= (tx_data.size() * 2));
            TEST_ASSERT_TRUE(dma_map.tx.stream->NDTR > tx_data.size()); // Strictly more than 1x confirms doubling happened

            TEST_ASSERT_TRUE_MESSAGE(wait_for(s_tx_done), "I2S DMA oneshot TX never completed");

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void oneshot_rejects_size_that_would_overflow_the_dma_transfer_length() {
            // At a 32-bit frame, actual_size = size * 2. Pick a size just over half of UINT16_MAX
            // so the doubled value overflows the field the driver packs it into.
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.frame               = I2S_DATA_32_BITS_FRAME_32_BITS;

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));
            audio_pll_clock_config(config.audio_clock);

            std::array<uint32_t, 1024> tx_data{};
            constexpr uint16_t         oversized = 40'000;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_SIZE, i2s_master_transmit_oneshot(TEST_INSTANCE, tx_data.data(), oversized, nullptr, nullptr));

