engineer-ae3o/stm32-hal-library/components/test/src/i2s.cpp
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void dbm_start_and_stop_toggle_the_dma_stream_enable_bit() {
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &DEFAULT_RX_CONFIG));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_init(TEST_INSTANCE, DMA_PRIORITY_LOW));

            std::array<uint16_t, 4> buf_0{};
            std::array<uint16_t, 4> buf_1{};

            s_dbm_completions = 0;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dbm_init(TEST_INSTANCE, buf_0.data(), buf_1.data(), buf_0.size(), dbm_callback, nullptr));

            dma_stream_map_t dma_map;
            TEST_ASSERT_EQUAL(HAL_OK, spi_master_get_dma_stream_map(&dma_map, 1));
            TEST_ASSERT_FALSE(dma_map.rx.stream->CR & DMA_SxCR_EN);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dbm_start(TEST_INSTANCE));
            TEST_ASSERT_TRUE(dma_map.rx.stream->CR & DMA_SxCR_EN);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dbm_stop(TEST_INSTANCE));
            TEST_ASSERT_FALSE(dma_map.rx.stream->CR & DMA_SxCR_EN);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dbm_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void dbm_filled_buffer_index_alternates_across_completions() {
            // Small buffers at a moderate clock so a handful of half-buffer completions happen within the
            // wait budget below. Content is irrelevant. Only the CT/buffer index bookkeeping is under test.

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &DEFAULT_RX_CONFIG));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_init(TEST_INSTANCE, DMA_PRIORITY_HIGH));
            audio_pll_clock_config(DEFAULT_RX_CONFIG.audio_clock);

            std::array<uint16_t, 1024> buf_0{};
            std::array<uint16_t, 1024> buf_1{};

            s_dbm_completions = 0;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dbm_init(TEST_INSTANCE, buf_0.data(), buf_1.data(), buf_0.size(), dbm_callback, nullptr));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dbm_start(TEST_INSTANCE));

            TEST_ASSERT_TRUE_MESSAGE(wait_for_count(s_dbm_completions, 1), "First I2S DBM half transfer never completed");
            uint8_t first_idx = 0xFFU;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dbm_get_filled_buffer(TEST_INSTANCE, &first_idx));

            TEST_ASSERT_TRUE_MESSAGE(wait_for_count(s_dbm_completions, 2), "Second I2S DBM half transfer never completed");
            uint8_t second_idx = 0xFFU;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dbm_get_filled_buffer(TEST_INSTANCE, &second_idx));

            TEST_ASSERT_TRUE(first_idx == 0 || first_idx == 1);
            TEST_ASSERT_NOT_EQUAL(first_idx, second_idx);

            // Ensure multiple buffer swap operations happen
            s_dbm_completions = 0;
            TEST_ASSERT_TRUE(wait_for_count(s_dbm_completions, 100));

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dbm_stop(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dbm_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

    } // namespace

    void all() {
        LOGI(TAG, "Starting the tests on the I2S driver");
        UNITY_BEGIN();

        RUN_TEST(invalid_arg_guards);
        RUN_TEST(init_rejects_invalid_audio_clock_without_touching_registers);
        RUN_TEST(init_rejects_prescaler_below_the_supported_range);
        RUN_TEST(init_rejects_prescaler_above_the_supported_range);
        RUN_TEST(deinit_clears_control_registers);
        RUN_TEST(init_programs_i2smod_direction_mode_and_polarity);
        RUN_TEST(init_programs_the_configured_frame_size);
        RUN_TEST(mclk_pin_only_programmed_when_use_mck_is_set);
        RUN_TEST(clk_enable_toggles_the_correct_bus_bit);
        RUN_TEST(dma_init_rejects_unsupported_instances);
        RUN_TEST(transmit_oneshot_completes_and_invokes_callback);
        RUN_TEST(receive_oneshot_completes_and_invokes_callback);
        RUN_TEST(oneshot_rejects_a_call_while_a_transfer_is_still_in_flight);
        RUN_TEST(oneshot_doubles_transfer_length_for_24_and_32_bit_frames);
        RUN_TEST(oneshot_rejects_size_that_would_overflow_the_dma_transfer_length);
        RUN_TEST(dbm_start_and_stop_toggle_the_dma_stream_enable_bit);
        RUN_TEST(dbm_filled_buffer_index_alternates_across_completions);

        UNITY_END();
        LOGI(TAG, "Done with all tests on the I2S driver");
    }

} // namespace test::i2s
